Revit 2027 API
PrintManager.IsVirtual Property
 The virtual type in Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VirtualPrinterType IsVirtual { get; }
Public ReadOnly Property IsVirtual As VirtualPrinterType
	Get
public:
property VirtualPrinterType IsVirtual {
	VirtualPrinterType get ();
}
member IsVirtual : VirtualPrinterType with get
Property Value
VirtualPrinterType
See Also
Reference
PrintManager Class
Autodesk.Revit.DB Namespace